import { PlanPage } from './../plan/plan';
import { Component } from '@angular/core';
import { IonicPage, NavController, NavParams } from 'ionic-angular';

/**
 * Generated class for the PopularQuestionPage page.
 *
 * See https://ionicframework.com/docs/components/#navigation for more info on
 * Ionic pages and navigation.
 */

@IonicPage()
@Component({
  selector: 'page-popular-question',
  templateUrl: 'popular-question.html',
})
export class PopularQuestionPage {

  constructor(public navCtrl: NavController, public navParams: NavParams) {
  }

  data: any;
  question: any;
  answer: any;
  quest = this.navParams.get('quest');
  state_forw = this.navParams.get('btn_forw');
  state_back = this.navParams.get('btn_back');
  btn_state1: boolean;
  btn_state2: boolean;

  ionViewDidLoad() {
    console.log('ionViewDidLoad PopularQuestionPage');
    this.getData();
    this.btn_state2 = true;
    this.btn_state1 = true;
  }

  closePage() {
    this.navCtrl.push(PlanPage);
  }

  backTo() {
    this.quest = this.quest - 1;
    console.log(this.quest);
    if (this.quest <= 1) {
      this.btn_state1 = false;
    }
    else {
      this.btn_state1 = true;
    }
    this.navCtrl.setRoot(PopularQuestionPage, { 'quest': this.quest, 'btn_forw': true, 'btn_back': this.btn_state1 });
  }

  nextPage() {
    this.quest = this.quest + 1;
    console.log(this.quest);
    if (this.quest >= 7) {
      this.btn_state2 = false;
    }
    else {
      this.btn_state2 = true;
    }
    this.navCtrl.setRoot(PopularQuestionPage, { 'quest': this.quest, 'btn_forw': this.btn_state2, 'btn_back': true });
  }

  getData() {
    this.data = {
      '1': {
        'question': 'ถ้าเลิกบุหรี่กะทันหันอันตรายไหม ผลข้างเคียงร้ายเเรงแค่ไหน?',
        'answer': 'ตอบ การเลิกบุหรี่แบบหักดิบ อาจทำให้เกิดอาการกระวนกระวาย เปรี้ยวปากอยากสูบ หงุดหงิด นอนไม่หลับ อ่อนเพลีย ไม่สุขสบายตัวได้ แต่โดยทั่วไปอาการผิดปกติเหล่านี้จะค่อยๆหายไปหลังจากหยุดบุหรี่ได้ตั้งแต่ 2สัปดาห์-1เดือนขึ้นไป แต่บางรายมีอาการมากจนทนไม่ได้กับอาการผิดปกติที่เกิดหลังจากการเลิกบุหรี่ก็แนะนำให้พบจิตแพทย์รับการรักษาด้วยยาเพื่อลดอาการผิดปกติที่เกิดขึ้น จะทำให้ผู้ที่ต้องการเลิกบุหรี่สามารถเลิกหรืออดบุหรี่ได้ง่ายขึ้น ระหว่างอดบุหรี่ควรออกกำลังกายทุกวัน พยายามจิบน้ำเปล่าบ่อยๆ หรืออาจใช้สมุนไพรกานพลู มะนาว มะขามเปียก ก็จะช่วยลดอาการหงุดหงิดเปรี้ยวปากได้เช่นกัน'
      },
      '2': {
        'question': 'จะทำอย่างไรถึงจะเลิกสูบบุหรี่ได้ถาวร เคยหยุดได้แต่พอเห็นคนอื่นสูบแล้วก็อยากสูบอีกเลยกลับมาสูบ จะทำอย่างไรถึงไม่ให้อยากสูบเวลาเห็นคนอื่นสูบ?',
        'answer': 'ตอบ พยายามหาตัวกระตุ้นว่ามีอะไรที่ทำให้กลับไปสูบซ้ำได้(ตัวกระตุ้นมีภายนอกได้แก่ เพื่อนที่สูบบุหรี่ กลิ่นบุหรี่ อุปกรณ์ต่างๆเกี่ยวกับการสูบบุหรี่ เงิน ฯลฯ ตัวกระตุ้นภายในได้แก่ ความเครียด กระวนกระวาย จิตใจไม่เข้มแข็ง พฤติกรรมความเคยชินเช่นสูบหลังมื้ออาหาร สูบพร้อมกับการดื่มกาแฟ สูบขณะขับถ่าย ฯลฯ ) เมื่อทราบตัวกระตุ้นที่ทำให้คุณต้องกลับไปสูบซ้ำแล้วพยายามหลีกเลี่ยงตัวกระตุ้นเหล่านั้น พร้อมทั้งพูดคุยกับเพื่อนและคนในครอบครัวเพื่อให้กำลังใจและสนับสนุนทำให้เลิกได้ ระหว่างที่หยุดได้ ช่วง2สัปดาห์-1เดือนมักมีอาการข้างเคียงไม่สบายตัวเกิดขึ้นได้เช่น หลับยาก กระวนกระวาย เบื่อๆเซ็งๆ ไม่กระฉับกระเฉง สมองตื้อๆ เปรี้ยวปาก หาวบ่อย ให้เข้าใจว่าอาการเหล่านี้เป็นภาวะปกติในขณะที่หยุดสูบบุหรี่ พอเวลาผ่านไปร่างกายก็จะปรับสู่ภาวะปกติ ในระยะเวลานี้คุณควรตระหนักและปกป้องตัวเองจากตัวกระตุ้นอย่างเข้มงวด หรืออาจใช้ตัวช่วยได้แก่ การอมกานพลู อมมะนาวหรือผลไม้รสเปรี้ยว จิบน้ำบ่อยๆ อาบน้ำบ่อยๆ ออกกำลังกาย ทำกิจกรรมผ่อนคลายความเครียด..เมื่อหยุดได้อย่างต่อเนื่องเกิน1ปีจึงจะถือว่าคุณเลิกบุหรี่ได้ ระหว่างที่หยุดหรือเลิกได้แล้วไม่ควรท้าทายตัวเองโดยการกลับไปลองสูบซ้ำอีกเนื่องจากการเลิกครั้งต่อๆไปจะเลิกได้ยากและมักจะไม่สำเร็จ'
      },
      '3': {
        'question': 'ปรับความคิดยังไงเมื่อต้องการเลิกบุหรี่?',
          'answer': 'ตอบ การที่จะเลิกสูบได้ ขึ้นอยู่กับตัวเอง และความคิดของเราก่อน เราจะต้องเตรียมตัว ตั้งใจแน่วแน่ ว่าต้องเลิกบุหรี่ด้วยตัวเอง เตรียมความพร้อมทั้งร่างกายและจิตใจ อาจจะต้องหาแรงจูงใจ เช่น ทำเพื่อลูกของเรา ครอบครัวเรา หรือคนรอบตัวเรา ในเมื่อเรามีเป้าหมายเราก็จะสามารถเลิกได้ ให้นึกถึงข้อเสียของบุหรี่และโทษที่ตามมาต่อเราเองและคนอื่น จากนั้นก็ปรับเปลี่ยนพฤติกรรม ได้แก่ หลีกเลี่ยงสถานที่ที่ทำให้นึกถึงหรือเคยสูบบุหรี่ ให้หาสิ่งที่แทนบุหรี่ เช่นหมากฝรั่ง สุดท้ายก็ย้ำตัวเองบ่อยๆ พยายามหากลุ่มเพื่อนหรือชมรมที่ต้องการเลิกบุหรี่เหมือนกันเพื่อจะได้มีกำลังใจในการเลิก'
      },
      '4': {
        'question': 'การหยุดสูบบุหรี่ ควรจะหยุดทันที หรือควรจะค่อยๆหยุด?',
          'answer': 'ตอบ ผู้ที่หยุดสูบบุหรี่ได้สำเร็จนั้น ส่วนใหญ่ใช้วิธีหยุดสูบทันที ในผู้ที่ค่อยๆลดจำนวนนั้น มักจะไม่สามารถหยุดสูบได้ และยังทำให้กลับไปสูบได้มากขึ้นอีก'
      },
      '5': {
        'question': 'เมื่อหยุดสูบบุหรี่ ทำไมจึงรู้สึกหงุดหงิด?',
          'answer': 'ตอบ ใช่ว่าทุกคนที่เลิกสูบบุหรี่จะมีอาการหงุดหงิดเสมอไป แต่ถ้ามีอาการก็จะเกิดมากที่สุดใน ๒-๓ วันแรก อาจจะโมโหง่าย ขาดสมาธิ มึนศีรษะ นอนไม่หลับ หลังจาก ๓ วันไปแล้วอาการจะค่อยๆลดลง และน้อยมากที่จะมีอาการเกิน ๑ สัปดาห์'
      },
      '6': {
        'question': 'หากมีอาการหงุดหงิด ควรทำอย่างไร?',
          'answer': 'ตอบ ตั้งสติให้มั่นบอกกับตัวเอง ว่าจะต้องชนะใจตัวเอง หยุดสูบบุหรี่ ให้ได้ อย่าอยู่เฉยๆคนเดียว หากิจกรรมมาทำ เช่น ออกกำลังกาย อ่านหนังสือ เป็นต้น งดการดื่มกาแฟ เหล้า หรือเครื่องดื่มผสมแอลกอฮอล์ทุกชนิด ถ้าหงุดหงิดมากให้ดื่มน้ำเย็น หรือให้อาบน้ำ'
      },
      '7': {
        'question': 'ทำอย่างไรให้คุมใจไม่สูบบุหรี่อีก ?',
          'answer': 'ตอบ  บางอย่างสามารถกระตุ้นให้เกิดความอยากบุหรี่ได้เช่นกันเรียกว่าตัวกระตุ้น (trigger) อาจเป็นอารมณ์ ความรู้สึก สถานที่ หรือสิ่งที่ทำ เช่น รู้สึกเครียด เศร้า คุยโทรศัพท์ ดื่มสุรา ดูทีวี ขับรถ หลังอาหาร เล่นเกม หยุดพักระหว่างงาน อยู่กับคนที่สูบบุหรี่ ดื่มกาแฟ เห็นคนอื่นกำลังสูบบุหรี่ เหงา เป็นต้น'
      },
    }

    this.question = this.data[this.quest]['question'];
    this.answer = this.data[this.quest]['answer'];
   }

}
