import { NativePageTransitions, NativeTransitionOptions } from '@ionic-native/native-page-transitions';
import { HomePage } from './../home/home';
import { PlanPage } from './../plan/plan';
import { Component } from '@angular/core';
import { IonicPage, NavController, NavParams } from 'ionic-angular';
import { AngularFirestore } from 'angularfire2/firestore';
import { LOCALE_DATA } from '@angular/common/src/i18n/locale_data';

/**
 * Generated class for the PlanDescriptionPage page.
 *
 * See https://ionicframework.com/docs/components/#navigation for more info on
 * Ionic pages and navigation.
 */

@IonicPage()
@Component({
  selector: 'page-plan-description',
  templateUrl: 'plan-description.html',
})
export class PlanDescriptionPage {

  nextDay: number;
  btn_state2: boolean;
  btn_state1: boolean;
  items: any = [];
  description: any;
  text: string = '';
  text_day: string = '';
  text_mid: string = '';
  text_noon: string = '';
  data: any;

  constructor(
    public navCtrl: NavController,
    public navParams: NavParams,
    public nativePageTransitions: NativePageTransitions,
    public firebaseFirestore: AngularFirestore,
  ) {
  }

  ionViewDidLoad() {
    this.btn_state2 = true;
    this.btn_state1 = true;
    
    this.getData();
   
  }

  selectDay = this.navParams.data;
  thisDay = this.navParams.get('day');
  state_forw = this.navParams.get('btn_forw');
  state_back = this.navParams.get('btn_back');

  closePage() {
    this.navCtrl.push(PlanPage);
  }

  backTo() {
    this.nextDay = this.thisDay - 1;
    console.log(this.nextDay);
    if (this.nextDay <= 1) {
      this.btn_state1 = false;
    }
    else {
      this.btn_state1 = true;
    }
    this.navCtrl.push(PlanDescriptionPage, { 'day': this.nextDay, 'btn_forw': true, 'btn_back': this.btn_state1 });
  }

  nextPage() {
    this.nextDay = this.thisDay + 1;
    console.log(this.nextDay);
    if (this.nextDay >= 30) {
      this.btn_state2 = false;
    }
    else {
      this.btn_state2 = true;
    }
    let options: NativeTransitionOptions = {
      direction: 'left',
      duration: 250,
      slowdownfactor: -1,
      slidePixels: 0,
      iosdelay: 20,
      androiddelay: 0,
      fixedPixelsTop: 0,
      fixedPixelsBottom: 48
    };

    this.nativePageTransitions.slide(options)
    this.navCtrl.setRoot(PlanDescriptionPage, { 'day': this.nextDay, 'btn_forw': this.btn_state2, 'btn_back': true });
  }

  swipePage(event) {
    this.nextDay = this.thisDay + 1;
    console.log(this.nextDay);
    if (this.nextDay >= 30) {
      this.btn_state2 = false;
    }
    else {
      this.btn_state2 = true;
    }

    // this.navCtrl.push(PlanDescriptionPage,{'day': this.nextDay,'btn_forw': this.btn_state2, 'btn_back': true});
    if (event.direction === 2) {
      let options: NativeTransitionOptions = {
        direction: 'left',
        duration: 250,
        slowdownfactor: -1,
        slidePixels: 0,
        iosdelay: 20,
        androiddelay: 0,
        fixedPixelsTop: 0,
        fixedPixelsBottom: 48
      };

      this.nativePageTransitions.slide(options)
      this.navCtrl.setRoot(PlanDescriptionPage, { 'day': this.nextDay, 'btn_forw': this.btn_state2, 'btn_back': true });
      //this.navCtrl.push(HomePage);
    }
    else if (event.direction === 4) {
      this.navCtrl.push(PlanPage);
    }
  }


  
  getData() {
    this.data = {
      '1' :{'text': 'Day –  1  สวัสดีค่ะ ก่อนอื่นขอแสดงความยินดีด้วยค่ะ ที่คุณมีความคิดที่ต้องการจะเลิกสูบบุหรี่ เพราะว่าการเลิกสูบบุหรี่นั้นจะเป็นผลดีต่อตัวคุณเองและคนรอบข้างคุณแน่นอนค่ะ เราขอเป็นหนึ่งกำลังใจให้คุณ มาสู้ไปด้วยกันนะคะ',
            'text_day': 'เช้า : หลังตื่นนอนตอนเช้าน้ำผสมมะนาวเพื่อลดความอยากในการสูบบุหรี่  และ ทำกิจวัตร	ประจำวัน อาบน้ำ ล้างหน้า แปรงฟันให้สดชื่น',
            'text_mid': 'กลางวัน : - หากคุณอยากสูบบุหรี่ให้อมลูกอม ผลไม้ที่มีรสชาติเปรี้ยว หากคุณยังมีอาการอยากสูบบุหรี่อยู่ สามารถเคี้ยวหมากฝรั่ง และใช้ยาที่มีส่วนผสมสารนิโคติน ซึ่งต้องปรึกษาแพทย์ในการใช้ (ลิ้งรายละเอียดหมากฝรั่ง) 	- ระหว่างวันหากมีอาการหงุดหงิด ให้คุณปฏิบัติตามนี้ (ลิ้ง) 	- พยายามหลีกเลี่ยงสิ่งกระตุ้น ที่ทำให้คุณอยากสูบบุหรี่ เช่น สถานที่ที่เคยสูบ อยู่ห่างไฟแช็ก',
            'text_noon': 'เย็น : 	- ออกกำลังกายและรับประทานอาหารที่มีประโยชน์ 	- หลีกเลี่ยงการพบปะสังคมเพื่อนที่ชวนให้กลับไปสูบบุหรี่ 	- หากรู้สึกอยากสูบบุหรี่แนะนำให้ดื่มน้ำมะนาว',
            'tip_head': 'ถ้าเลิกบุหรี่กะทันหันอันตรายไหม ผลข้างเคียงร้ายเเรงแค่ไหน',
            'tip_body': 'ตอบ การเลิกบุหรี่แบบหักดิบ อาจทำให้เกิดอาการกระวนกระวาย เปรี้ยวปากอยากสูบ หงุดหงิด นอนไม่หลับ อ่อนเพลีย ไม่สุขสบายตัวได้ แต่โดยทั่วไปอาการผิดปกติเหล่านี้จะค่อยๆหายไปหลังจากหยุดบุหรี่ได้ตั้งแต่ 2สัปดาห์-1เดือนขึ้นไป ระหว่างอดบุหรี่ควรออกกำลังกายทุกวัน พยายามจิบน้ำเปล่าบ่อยๆ หรืออาจใช้สมุนไพรกานพลู มะนาว มะขามเปียก ก็จะช่วยลดอาการหงุดหงิดเปรี้ยวปากได้เช่นกัน'
          },
      '2':{'text': 'Day – 2	สวัสดีเช้าที่สดใส ผ่าน1วันแล้วนะคะ วันนี้คงไม่ยากที่จะผ่านไปสู้ๆค่ะ',
          'text_day': 'เช้า : 	หลังตื่นนอนตอนเช้าน้ำผสมมะนาวเพื่อลดความอยากในการสูบบุหรี่  และ ทำกิจวัตร ประจำวัน อาบน้ำ ล้างหน้า แปรงฟันให้สดชื่น ถ้าเบื่อให้เปลี่ยนเป็นน้ำส้มหรือลองทำอาหารเช้ารับประทานดีไหมคะ',
          'text_mid': 'กลางวัน : หางานอดิเรกที่ชอบทำ เช่น เดินห้าง ดูหนัง เล่นเกมส์',
          'text_noon': 'เย็น : โทรหาคนที่สนิทหรือไว้ใจเพื่อเล่าเรื่องราวในชีวิต หรือดื่มนมก่อนนอน',
          'tip_head': 'แนะนำ : เมื่อหยุดสูบบุหรี่ ทำไมจึงรู้สึกหงุดหงิด',
          'tip_body': 'ใช่ว่าทุกคนที่เลิกสูบบุหรี่จะมีอาการหงุดหงิดเสมอไป แต่ถ้ามีอาการก็จะเกิดมากที่สุดใน ๒-๓ วันแรก อาจจะโมโหง่าย ขาดสมาธิ มึนศีรษะ นอนไม่หลับ หลังจาก ๓ วันไปแล้วอาการจะค่อยๆลดลง และน้อยมากที่จะมีอาการเกิน ๑ สัปดาห์ อาการนี้ไม่อันตรายเกิดขึ้นได้โดยทั่วไป ขอให้ตระหนักอยู่เสมอว่าเกิดจากการหยุดสูบบุหรี่ แต่จะเป็นแค่ 2-3 วันแรก จะค่อยๆดีขึ้น'
      },
      '3': {
        'text': 'Day – 3 สวัสดีเช้าที่สดใสค่ะ วันนี้เป็นวันที่3 ของการเลิกบุหรี่ ทุกความสำเร็จจะต้องใช้ความพยายาม		และเวลา พยายามต่อไปนะคะ คุณทำได้ค่ะ',
        'text_day': 'เช้า : 	หลังตื่นนอนตอนเช้าน้ำผสมมะนาวเพื่อลดความอยากในการสูบบุหรี่  และ ทำกิจวัตร		ประจำวัน อาบน้ำ ล้างหน้า แปรงฟันให้สดชื่น ถ้าเบื่อให้เปลี่ยนเป็นน้ำส้มหรือลอง ทำอาหารเช้ารับประทานดีไหมคะ',
        'text_mid': 'กลางวัน : หางานอดิเรกที่ชอบทำ เช่น เดินห้าง ดูหนัง เล่นเกมส์  หรือหากวันนี้เป็นวันทำงานปรับเปลี่ยนมุมในการทำงาน จัดโต๊ะทำงานใหม่ ',
        'text_noon': 'เย็น : 	โทรหาเพื่อนที่สนิทหรือเพื่อนที่ไว้ใจเพื่อเล่าเรื่องราวในชีวิต ดื่มนมอุ่นๆก่อนนอน',
        'tip_head': 'แนะนำ หากมีอาการหงุดหงิด ควรทำอย่างไร',
        'tip_body': 'ตั้งสติให้มั่นบอกกับตัวเองให้รู้ตัวว่ากำลังหงุดหงิดจากการหยุดบุหรี่ พยายามหาเวลาให้อาการหงุดหงิดลดลง ตามที่ตนเองเคยทำได้สำเร็จ เช่น หากิจกรรมที่เคยชอบทำแล้วรู้สึกดีได้แก่ ออกกำลังกาย อ่านหนังสือ เป็นต้น กิจกรรมที่ควรหลีกเลี่ยงเมื่อเกิดอาการหงุดหงิดได้แก่  การดื่มกาแฟ เหล้า หรือเครื่องดื่มผสมแอลกอฮอล์ทุกชนิด ',
      },
      '4': {
        'text': 'Day – 4 สวัสดีค่ะผ่านมา	4 วันแล้ว ตอนนี้อาการหงุดหงิดและอยากสูบบุหรี่ลดลงบ้างไหมคะ เนื่องจากสารนิโคตินในร่างกายเริ่มจะลดลงแล้วเห็นไหมคะว่าความพยายามของคุณไม่สูญเปล่าเลย พยายามต่อไปนะคะ',
        'text_day': 'เช้า : 	หลังตื่นนอนตอนเช้าน้ำผสมมะนาวเพื่อลดความอยากในการสูบบุหรี่  และ ทำกิจวัตร				ประจำวัน อาบน้ำ ล้างหน้า แปรงฟันให้สดชื่น',
        'text_mid': 'กลางวัน : ตอนนี้เป็นวันดี ๆของคุณถ้าคุณพอมีเวลาว่างให้คุณลองให้รางวัลชีวิตตัวเอง เช่น ทานอาหาร	ที่ชอบ พาครอบครัวไปเที่ยว ดูหนังฟังเพลง เล่นกีฬา ดนตรี',
        'text_noon': 'เย็น : 	ออกกำลังกายที่ถนัด หรือ ทำงานอดิเรก ก่อนนอนลองทำ 3 seconds breathing โดยการหายใจเข้าออกนับ 1 2 3',
        'tip_head': 'แนะนำ ทำ three second breathing  (การทำสมาธิโดยการหายใจเข้าออกนับ1-3ในใจ)',
        'tip_body': ' วิธีการกำหนดลมหายใจเข้าออก ทำจิตใจให้ผ่อนคลาย หายใจเข้านับ 1-3 จากนั้นหายใจออกนับ 1-3 เช่นกัน ทำไปเรื่อยๆ(สูดลมหายใจทางจมูกพร้อมกับกลั้นหายใจโดยธรรมชาติ) เพื่อผ่อนคลายระบบประสาท เพิ่มสมาธิและลดความเครียด'
      },
      '5': {
        'text': 'Day – 5		สวัสดีค่ะ เข้าสู่วันที่ 5 ของสัปดาห์แล้วคุณรู้สึกอย่างไรบ้างคะ  คุณได้ผ่านช่วงเวลาที่ยากมาแล้วนะคะ คุณเก่ง และทำได้ดีมากพยายามต่อไปนะคะ',
        'text_day': 'เช้า : 	ออกกำลังกายสัก 30 นาที วันนี้หากคุณว่างหาเวลาทำวามสะอาดบ้าน สิ่งของเครื่องใช้ให้ปราศจากกลิ่นของบุหรี่',
        'text_mid': 'กลางวัน : ทานอาหารที่มีประโยชน์ และ หากคุณรู้สึกง่วงนอนอาจงีบเล็กน้อย',
        'text_nood': 'เย็น :  	ให้คุณลองคิดเมนูอาหารที่จะกิน และลงมือทำเลยค่ะ หากคุณรู้สึกสับสนท้อแท้ให้ปรึกษาคนที่คุณสนิท หรือ ครอบครัวเพื่อระบายความรู้สึกนั้น ',
        'tip_head': '',
        'tip_body': 'แนะนำ การออกกำลังกาย ไม่เพียงแต่ช่วยให้ทุกชีวิตมีสุขภาพดี แต่ยังช่วยให้สามารถเลิกสูบบุหรี่ได้ด้วย จากงานวิจัยพบว่า การออกกำลังกายเพียง 5 นาที ทำให้ผู้ที่ติดบุหรี่อยู่สามารถเอาชนะความอยากบุหรี่ที่เกิดขึ้นได้ ควรทำควบคู่กันไปกับการเลิกบุหรี่ โดยเฉพาะการออกกำลังกายประเภทที่มีความต่อเนื่อง เช่น เดิน วิ่งเหยาะๆ วิ่งทางไกล ว่ายน้ำ ถีบจักรยาน กระโดดเชือก หรือเต้นแอโรบิก ฯลฯ เป็นต้น'
      },
      '6': {
        'text': 'Day – 6		สวัสดีค่ะคุณเก่งมากเลยนะคะ ผ่านมาได้ 6 วันแล้วคะ ',
        'text_day': 'เช้า : 	วันนี้ความรู้สึกอยากสูบบุหรี่ของคุณลดลงบ้านไหมคะ หากคุณรู้สึกอยากสูบบุหรี่ให้คุณดื่มน้ำ ผสมมะนาว หรือลองหาของว่างรับประทาน เช่น ถั่วต่างๆ',
        'text_mid': 'กลางวัน : หลังจากทานอาหารกลางวันแล้ว ลองหากิจกรรมผ่อนคลาย เช่น ฟังเพลง เล่นเกมส์ งีบเล็กน้อย',
        'text_nood': 'เย็น :	 ถ้าคุณว่างลองหากิจกรรมที่ใช้สมาธิทำ เช่น อ่านหนังสือพิมพ์ หรือทำสมาธิ ก่อนเข้านอนลองอ่านหนังสือ สวดมนต์ เพื่อทำจิตใจของคุณให้สงบขึ้น และ ดื่มนมอุ่นๆ ก่อนนอน เพื่อผ่อนคลาย ยินดีกับสิ่งที่คุณได้ผ่านไปได้ในวันนี้ ',
        'tip_head': 'แนะนำ เคล็ดลับเลิกบุหรี่ : 3 หา',
        'tip_body': '1.หาที่ปรึกษา	ปรึกษาคนที่เลิกบุหรี่ได้สำเร็จ  หรือ  โทร 1600 2.หากำลังใจ	ให้คนใกล้ชิดรู้ความตั้งใจที่เลิกบุหรี่  กำลังใจช่วยให้พยายามเลิกสูบได้ 3.หาเป้าหมาย	กำหนดวันเลิกบุหรี่อาจเลือกวันสำคัญต่าง ๆ  แต่ไม่คสรกำหนดวันที่ไกลเกินไป'
      },
      '7': {
        'text': 'Day – 7 เป็นเวลา 1 สัปดาห์แล้วที่คุณผ่านมาได้ สุดยอดไปเลยค่ะ',
        'text_day': 'เช้า : 	ตื่นเช้าสักนิดไปจ่ายตลาด ซื้อของมาใส่บาตร ทำจิตใจให้แจ่มใส พร้อมสู้และอดทนกับสิ่งที่ คุณกำลังเลิกมัน',
        'text_mid': 'กลางวัน : ทานอาหารที่มีปะโยชน์ ผัก ผลไม้ บำรุงร่างกายอย่างสม่ำเสมอ',
        'text_nood': 'เย็น : 	วางแผนนำเงินที่ประหยัดได้จากการเลิกบุหรี่มาเป็นรางวัลให้กับตนเอง เช่น ซื้อของที่อยากได้ ท่องเที่ยว หรือ ทานอาหารที่อร่อยๆ',
        'tip_head': 'แนะนำ : 5 ตัวช่วยให้เลิกบุหรี่ได้ง่ายขึ้น!',
        'tip_body': '1 "น้ำเปล่า" : ดื่มน้ำเยอะ ๆ น้ำจะช่วยนำนิโคตินออกไปจากร่างกาย ความอยากบุหรี่จะลดลง 2 "นมสด" : ลองดื่มนมก่อนสูบบุหรี่ เพราะนมจะทำให้บุหรี่มีรสชาติแย่มาก 3 "ผลไม้": จะกินแบบสด ๆ หรือคั้นแบบน้ำผลไม้ก็ได้ เพราะจะทำให้ขมปาก ไม่อยากบุหรี่ 4 "มะนาว" : วันละ 1 ผล ไปเพิ่มวิตามินซี ช่วยลดอาการหงุดหงิด และไปทำให้บุหรี่มีรสขม 5 "มะขามป้อม" : ถ้าพอจะหาได้ ความเปรี้ยวปรี๊ดของมะขามป้อมจะช่วยให้ลดความอยากบุหรี่'
      },
      '8': {
        'text': 'Day – 8	เริ่มต้นสัปดาห์ที่ 2 ของการเลิกบุหรี่แล้ว คุณรู้สึกว่าตัวเองมีอะไรเปลี่ยนแปลงบ้างคะ ',
        'text_day': 'เช้าและกลางวัน : วันนี้เป็นวันที่ดีเรา หากเป็นไปได้ คุณควรหาเวลาพักผ่อน ลองออกไปทำกิจกรรมยามว่างที่คุณชอบ หรือทำกิจกรรมร่วมกับครอบครัว เช่น รับประทานอาหาร เล่นกีฬา ปลูกต้นไม้',
        'text_mid': '',
        'text_nood': 'เย็น : 	ทบทวน วิเคราะห์ปัญหาอุปสรรคในสัปดาห์ที่ผ่านมาแล้วเขียนลงในกระดาษ พรุ่งนี้มาแก้ไขปัญหาด้วยกัน สำหรับคืนนี้พักผ่อนให้สบายนะคะ',
        'tip_head': 'แนะนำ การจดบันทึกดีอย่างไร',
        'tip_body': 'ช่วยประมวลเรื่องราวที่เกิดขึ้น,ช่วยทำให้เข้าใจความคิดตัวเอง,ช่วยให้มองเห็นบริบทของชีวิต,ช่วยให้เราเท่าทันความรู้สึกของตัวเอง,ทำให้เราเชื่อมต่อกับจิตใจของตัวเอง,เป็นตัวช่วยบันทึกบทเรียนที่สำคัญ,เปิดโอกาสให้เราได้ถามคำถามกับตัวเอง'
      },
      '9': {
        'text': 'Day – 9	วันนี้คุณลองส่องกระจกแล้วหรือยัง คุณพบคุณคนใหม่ในนั้นหรือเปล่า อย่าลืมยิ้มให้เขานะคะ',
        'text_day': 'เช้า : 	ออกกำลังกายสัก 30 นาที ทำจิตใจให้สดชื่น ',
        'text_mid': 'กลางวัน : นำปัญหาอุปสรรคที่คุณได้บันทึกไว้มาลองแก้ไข เช่น นำความเครียดที่สะสมภายในระบายออกมาโดยการโทรหาเพื่อนสนิท หรือ ครอบครัวที่พร้อมสนับสนุนคุณเสมอ',
        'text_nood': 'เย็น : 	ทบทวนวิธีการแก้ไขปัญหาของคุณว่าได้ผลหรือไม่ หากมีข้อไหนที่ยังไม่ได้รับการแก้ไขคุณลองหาวิธีใหม่ๆ แล้วลองทำใหม่นะคะ เราเป็นกำลังใจให้คุณเสมอ',
        'tip_head': 'แนะนำ : อย่าใจอ่อนกับตัวเองเป็นอันขาด ',
        'tip_body': 'เชื่อว่าคงมีหลายคนที่บอกกับตัวเองว่า “อีกสักมวนคงไม่เป็นไร” หรือ “วันนี้สักหน่อยก่อนแล้วกัน พรุ่งนี้ค่อยเลิก” ฯลฯ รวมไปถึงการท้าทายตัวเอง โดยคิดว่ากลับไปลองสูบบ้างเป็นครั้งคราวคงไม่เป็นไร เหล่านี้ห้ามเด็ดขาด เพราะนั่นหมายถึงความพยายามที่คุณตั้งใจมาทั้งหมดนั้นมันจะสูญเปล่า ไม่มีค่า หรือเกิดประโยชน์ใด ๆ กับคุณเลย คุณต้องใจแข็งและผ่านมันไปให้ได้'
      },
      '10': {
        'text': 'Day – 10',
        'text_day': 'เช้า : 	วันนี้คุณเป็นคนใหม่แล้ว ลองไปพบปะเพื่อนๆให้เขาเห็นคุณคนใหม่ และบอกเขาว่าคุณเลิกบุหรี่แล้วเพื่อให้เขาเป็นกำลังใจให้คุณ',
        'text_mid': 'กลางวัน : เปลี่ยนแปลงพฤติกรรมจากเดิม สร้างพฤติกรรมใหม่ที่ไม่สุ่มเสี่ยง เช่น หลีกเลี่ยงการนั่งโต๊ะอาหารนานๆ จัดห้องนอนหรือห้องทำงานให้แปลกใหม่กว่าเดิม ติดโปสเตอร์เตือนสติไว้ตามพื้นที่สุ่มเสี่ยง',
        'text_nood': 'เย็น : 	แนะนำให้คุณจดบันทึกไดอารี่เกี่ยวกับ สิ่งที่คุณทำได้สำเร็จ และ ปัญหาอุปสรรคที่พบในทุกวันเพื่อหาแนวทางการแก้ไขใหม่ๆ อยู่เสมอ พักผ่อนให้เพียงพอ ดื่มนมอุ่นๆ ซักแก้วก่อนนอน ',
        'tip_head': 'แนะนำ เทคนิคการเลิกบุหรี่',
        'tip_body': '1.ต้องมีความตั้งใจอย่างแน่วแน่จริงจัง 2.เตรียมตัวเตรียมใจให้พร้อม ที่จะรับมือกับอาการที่จะเกิดขึ้นตามมา เช่น อารมณ์หงุดหงิด กระสับกระส่าย อ่อนเพลีย ง่วงนอน เป็นต้น 3.ขอให้อดทนเพราะช่วงเวลานี้ ภายใน 2-7 วัน ร่างกายจึงจะขับสารนิโคตินออกไปได้หมด 4. ให้ทำการปฏิบัติเพิ่มเติมดังต่อไปนี้ งดรับประทานเนื้อสัตว์,หมั่นออกกำลังกายทุกวัน,ดื่มน้ำสะอาดให้มากๆ,ดื่มน้ำผลไม้ที่มีรสเปรี้ยว'
      },
      '11': {
        'text': 'Day – 11	 วันนี้คุณรู้สึกอย่างไรบ้าง ตื่นเช้ามาล้างหน้า แปรงฟังแล้วรู้สึกสดชื่นขึ้นบ้างไหมคะ',
        'text_day': 'เช้า : ลองเปลี่ยนสิ่งแวดล้อมรอบตัวคุณไหม เช่น รดน้ำต้นไม้ กวาดบริเวณบ้าน จัดสวนให้ดูสวยงาม ล้างรถ',
        'text_mid': 'กลางวัน : ลองออกไปซื้อของเข้าบ้านหรือของแต่งกลิ่นในบ้าน เช่น น้ำหอม สเปรย์ดับกลิ่นห้อง เพื่อให้สิ่งแวดล้อมรอบตัวคุณสดชื่นขึ้น',
        'text_nood': 'เย็น : 	แนะนำให้คุณไปออกกำลังกายนอกสถานที่เพื่อให้คุณเจอสิ่งแวดล้อมใหม่ๆ ทานอาหารที่มีประโยชน์ และสวดมนต์ไหว้พระก่อนนอน',
        'tip_head': 'แนะนำ  4 วิธีดับกลิ่นบุหรี่ในห้อง',
        'tip_body': 'หากกลิ่นบุหรี่ยังติดอยู่ในบ้านและติดตามเฟอร์นิเจอร์ คุณไม่ต้องกังวลไป คุณสามารถกำจัดกลิ่นได้ดังนี้ 1.	ใช้เครื่องมือกำจัดกลิ่นทั้งหมดในห้อง รวมไปถึงเฟอร์นิเจอร์ที่มีกลิ่นเหม็น 2.	ติดตั้งเครื่องฟอกอากาศ 3.	ทำความสะอาดพรม เพราะพรมสามารถดูดซับกลิ่นได้ 4.	ซักทำความสะอาดผ้าต่างๆ ในห้อง เพื่อกำจัดกลิ่นบุหรี่และช่วยลดคราบเถ้าบุหรี่ที่ก่อให้เกิดกลิ่นอีกด้วย '
      },
      '12': {
        'text': 'Day – 12	วันนี้เป็นวันที่สุดยอดมาก คุณเลิกบุหรี่มาได้จะครบ 2 สัปดาห์แล้วนะคะ เยี่ยมจริงๆคะ',
        'text_day': 'เช้า : 	แนะนำให้คุณเข้าวัดทำบุญหรือทำสมาธิให้จิตใจสดชื่นผ่องใส',
        'text_mid': 'กลางวัน : ทำกิจกรรม หรือรับประทานอาหารกลางวันร้านที่คุณชื่นชอบ',
        'text_nood': 'เย็น : 	ชวนเพื่อนหรือคนใกล้ชิดคุณให้มาร่วมทำกิจกรรมกับคุณ เช่น ร่วมกันปลูกต้นไม้และตกแต่งบ้าน เล่นดนตรี เล่นกีฬา ',
        'tip_head': null,
        'tip_body': null
      },
      '13': {
        'text': 'Day – 13	วันนี้คุณรู้สึกดีแค่ไหนที่คุณสามารถเลิกบุหรี่ได้ด้วยตนเอง',
        'text_day': 'เช้า : 	คิดถึงประโยชน์จากการเลิกสูบบุหรี่ เช่น การห่างไกลจากโรคระบบทางเดินหายใจ ได้แก่ มะเร็งปอดและถึงลมโป่งพอง เป็นต้น และมีเงินที่เหลือจากการเลิกสูบบุหรี่',
        'text_mid': 'กลางวัน : รับประทานอาหารกลางวันที่มีคุณค่าและเป็นประโยชน์ต่อตัวคุณเอง',
        'text_nood': 'เย็น : 	ชวนเพื่อนและครอบครัวมารับประทานอาหารร่วมกัน เล่าถึงความสำเร็จที่คุณเลิกบุหรี่ได้ และอย่าลืมทบทวนสิ่งที่เป็นปัญหาอุปสรรค และจดบันทึกไว้สม่ำเสมอพร้อมกับหาวิธีการแก้ไขที่เหมาะสมด้วย',
        'tip_head': null,
        'tip_body': null
      },
      '14': {
        'text': 'Day – 14	  เข้าสู่สัปดาห์ที่ 2 แล้วที่คุณไม่ยุ่งเกี่ยวกับบุหรี่ อย่าลืมคอยย้ำเตือนตัวเองอยู่เสมอนะคะ คุณทำได้ ',
        'text_day': 'เช้า : 	ส่องกระจกดูคุณคนใหม่สิคะ หน้าตาที่เปล่งปลั่ง ฟันที่ขาวสะอาด ร่างกายที่หอมสดชื่นมากขึ้น',
        'text_mid': 'กลางวัน : มองรอบๆ สิ่งแวดล้อมรอบตัวคุณ มีความสุขกับมัน หากคุณอยู่บ้านหันมาทำความสะอาด บริเวณบ้าน เฟอร์นิเจอร์ ถือว่าเป็นBig Cleaning Day ของคุณ',
        'text_nood': 'เย็น : 	คิดทบทวนดูว่าคุณมีกิจกรรมอดิเรกส่วนตัวที่ชื่นชอบบ้างหรือไม่ที่คุณอาจเคยพลาดไปในช่วงชีวิตที่ผ่านมาและจดบันทึกไว้ เตรียมตัวคุณให้พร้อมทำกิจกรรมเหล่านั้น',
        'tip_head': 'แนะนำ  ลองทบทวนกับตนเองว่าที่ผ่านมาเป็นอย่างไรบ้าง',
        'tip_body': 'เก็บบุหรี่ให้ห่างจากตัวคุณ , อยู่ให้ห่างไฟแช็ก , หลีกเลี่ยงการพบปะสังคมเพื่อนที่ชักชวนหรือสนับสนุนให้คุณกลับไปสูบอีก หากมีคนชักชวนให้กลับไปสูบอีกครั้งควรปฏิเสธ โดยให้เหตุผลว่าตนกำลังเลิกสูบบุหรี่และออกจากสถานการณ์นั้น เชื่อว่าคุณสามารถทำได้ดีมากขึ้น คุณมากๆเลย'
      },
      '15': {
        'text': 'Day – 15  Free day คุณสามารถทำกิจกรรมที่คุณอยากทำ เพื่อเป็นรางวัลให้กับชีวิตของคุณเอง อย่าลืมเตือนตนเองว่าคุณตอนนี้เข้มแข็งกว่าตัวคุณในอดีต และจะไม่กลับไปสูบหรี่อีก',
        'text_day': '',
        'text_mid': '',
        'text_nood': '',
        'tip_head': '',
        'tip_body': 'แนะนำ การให้รางวัลกับตนเอง โดยการทำอะไรบางอย่างที่เราอยากทำตามใจเรา ไม่ว่าจะเป็น ออกไปเดินเล่น หาอะไรกิน กินของที่เราชอบ ไปเที่ยวไปซื้อของที่อยากได้ ไปพูดคุยกับเพื่อน หาความสุขเล็กๆน้อยๆแต่การให้รางวัลกับตนเองเราก็ไม่ควรที่จะทำบ่อยจนเกินไป จนทำให้รู้สึกว่ามันมากเกินไปเพราะจะกลายเป็นเรื่องธรรมดารู้สึกไม่ตื่นเต้น'
      },
      '16': {
        'text': 'Day – 16	รู้สึกอย่างไรบ้าง ผ่านมาครึ่งเดือนแล้ว เหลืออีกครึ่งเดือนเท่านั้น… คุณทำมันได้!!',
        'text_day': 'เช้า : 	ทำบุญตักบาตร หรือทำสมาธิ เพื่อ ต้อนรับวันแรกของครึ่งหลังของการเลิกบุหรี่',
        'text_mid': 'กลางวัน : หาความรู้เพิ่มเติมให้ตัวคุณเองเกี่ยวกับประโยชน์ที่เกิดขึ้นจากการเลิกสูบบุหรี่ เช่น ระบบไหลเวียนและการทำงานของปอดดีขึ้นหลังหยุดสูบบุหรี่หลัง 2-12สัปดาห์',
        'text_nood': 'เย็น : 	เข้าเว็บไซต์ค้นหากิจกรรมเกี่ยวกับการเลิกบุหรี่ที่คุณสามารถเข้าร่วมได้ เช่น รณรงค์หยุดสูบบุหรี่ ฟังบรรยายแนวทางการเลิกบุหรี่ เช่น บุหรี่ตัวร้ายทำลายหัวใจของโรงพยาบาล หรือ ช่วยชุมชนด้วยการติดโปสเตอร์ห้ามสูบบุหรี่ในพื้นที่ห้ามสูบ',
        'tip_head': null,
        'tip_body': null
      },
      '17': {
        'text': 'Day – 17',
        'text_day': '',
        'text_mid': 'เช้า/กลางวัน : ทำกิจกรรมที่จดบันทึกและวางแผนไว้หรืออาจจะชวนเพื่อนและคนใกล้ชิดเข้าร่วมกิจกรรมด้วย',
        'text_nood': 'เย็น : ทบทวนสิ่งที่คุณได้ไปทำกิจกรรมในวันนี้มาว่าคุณสามารถช่วยคนอื่นและเป็นประโยชน์ต่อตัวคุณเองมากน้อยแค่ไหน พร้อมกับทบทวนว่าตลอดครึ่งเดือนที่ผ่านมาคุณได้ทำกิจกรรมเลิกบุหรี่อะไรบ้าง และวิเคราะห์ว่าคุณประสบความสำเร็วตามแผนที่วางไว้หรือไม่',
        'tip_head': null,
        'tip_body': null
      },
      '18': {
        'text': 'Day - 18   วันนี้คุณรู้สึกดีแค่ไหนที่คุณสามารถเลิกบุหรี่ได้ด้วยตนเอง',
        'text_day': 'เช้า: -วันนี้คุณลองไปวิ่งตอนเช้า เปลี่ยนบรรยากาศทานอาหารเช้าที่ร้านอาหารใกล้บ้าน ที่ทำงาน หรือโรงเรียน',
        'text_mid': 'กลางวัน: ให้คุณลองไปหาอะไรใหม่ๆทำ เช่น เข้าร่วมกิจกรรมอาสาสมัคร จิตอาสา ออกไปหาแรงบันดาลใจข้างนอก พูดคุยกับคนรอบข้าง เป็นต้น',
        'text_nood': 'เย็น: -นัดเจอบุคคลใกล้ชิด หรือเพื่อนให้มาร่วมทำอาหาร พบปะพูดคุยเป็นเพื่อน เพื่อให้เกิดความผ่อนคลาย และได้รับกำลังใจจากบุคคลรอบข้าง –คุณลองให้คนรอบข้างสังเกตตัวคุณว่ามีอะไรเปลี่ยนแปลงไปบ้าง',
        'tip_head': null,
        'tip_body': null
      },
      '19': {
        'text': 'Day -19  ผ่านมาได้19วันแล้ว คุณทำได้ดีมากค่ะ อย่าพึ่งท้อแท้หมดกำลังใจในการเลิกบุหรี่ไปนะคะ',
        'text_day': 'เช้า: เริ่มต้นวันนี้ด้วยการยิ้มให้กับคนรอบข้าง ออกไปพูดคุยหาเพื่อนใหม่ หางานอดิเรกใหม่ๆทำ ',
        'text_mid': 'กลางวัน : ชวนเพื่อนไปทานข้าวเที่ยงบ้าง แลกเปลี่ยนความ ',
        'text_nood': 'เย็น: ไปจ่ายตลาดซื้อของใช้เข้าบ้าน หรือออกไปหาซื้อหนังสือสักเล่มเพื่อไว้อ่านตอนว่าง หรือต้องการกำลังใจ คงไม่ยากเกินไปนะสู้ๆ',
        'tip_head': null,
        'tip_body': null
      },
      '20': {
        'text': 'Day – 20  เข้าสู่วันที่ 20 แล้วค่ะ คุณผ่านมาได้ขนาดนี้แล้วถือว่ามีความพยายามมากที่จะเลิกให้ได้ อยากให้คุณสู้ต่อไปอีกนิดนะคะ',
        'text_day': 'เช้า: ทำความสะอาดบ้าน มั่นใจว่าคุณได้เตรียมอาหารและของว่างที่มีประโยชน์สำหรับคุณเอง',
        'text_mid': 'กลางวัน: นอน/งีบพักผ่อน หลังจากทานอาหาร ',
        'text_nood': 'เย็น:ออกกำลังกาย เดินเล่น เพื่อผ่อนคลายความวิตกกังวล',
        'tip_head': '',
        'tip_body': 'แนะนำ วิธีการปฏิเสธมีหลายวิธีง่าย โดยสามารถเลือกใช้ได้ตามสถานการณ์ที่พบ เช่น เดินเลี่ยงไปเหมือนไม่ได้ยิน ควรปฏิเสธตรงๆ สั้นๆ หรือปฏิเสธแบบผัดผ่อนหรืออ้างเหตุต่างๆ หรืออาจจะเปลี่ยนเป็นพูดเรื่องอื่นแทรกขึ้นมาทันทีแทนการปฏิเสธ นอกจากนี้อาจเลี่ยงโดยชักชวนให้ทำกิจกรรมอื่นๆ เช่น เล่นกีฬา เล่นดนตรี หรืออื่นๆ'
      },
      '21': {
        'text': 'Day –21 วันนี้คุณเป็นอย่างไรบ้าง หน้าตาดูสดชื่น แจ่มใสมากขึ้นหรือเปล่า? ',
        'text_day': 'เช้า: มองรอบตัวหากยังมีสิ่งกระตุ้นที่ทำให้คุณอยากสูบบุหรี่ เช่น  ไฟแซ็ก เจอคนสูบบุหรี่ ให้คุณอย่าพึ่งยามแพ้ อย่าสนใจ ให้หากิจกรรมอื่นๆทำเพื่อเลี่ยงความสนใจ',
        'text_mid': 'กลางวัน: หากิจกรรมอย่างอื่นทำที่ผ่อนคลาย เช่น เล่นเกมส์ เล่นกีฬากับเพื่อน หรือหาหนังสือซักเล่มอ่าน',
        'text_nood': 'เย็น: สวดมนต์ เข้าวัด เพื่อทำบุญ หาที่สงบใจ หรือไปดูหนัง ฟังเพลงกับเพื่อน',
        'tip_head': null,
        'tip_body': null
      },
      '22': {
        'text': 'Day –22 แล้วคุณมีความมั่นใจในตนเองมากขึ้นหรือไม่ ',
        'text_day': 'เช้า: ตื่นเช้าจ่ายตลาด เพื่อนำมาประกอบอาหารที่บ้านและ ทำบุญตักบาตร เตรียมพร้อมรับวันใหม่',
        'text_mid': 'กลางวัน: รับประทานอาหารให้ครบ 5 หมู่ เรียบร้อยแล้ว จึงทำงานต่อ หรือทำกิจกรรมอย่างอื่นที่คุณชื่นชอบ ',
        'text_nood': 'เย็น:ฉลองให้กับตนเอง โดยการออกไปรับประทานอาหารนอกบ้านกับครอบครัวหรือเพื่อน และทบทวนสิ่งที่คุณได้ไปทำกิจกรรมในวันนี้มาว่าคุณสามารถทำประโยชน์ต่อตัวคุณเองมากน้อยแค่ไหน  ขอให้พยายามต่อไปนะค่ะ',
        'tip_head': null,
        'tip_body': null
      },
      '23': {
        'text': 'Day –23 สวัสดีค่ะ เหลืออีกเพียงแค่อาทิตย์เดียวแล้วนะคะที่คุณจะเลิกบุหรี่ได้สมบูรณ์ ',
        'text_day': 'เช้า: คุณลองคิดทบทวนว่ามีสิ่งใดที่คุณอยากทำให้ดีขึ้นบ้างในเช้านี้ แล้วคุณก็ลงมือทำมันเลยค่ะ เช่นทำประโยชน์ให้กับสังคม กิจกรรมจิตอาสา ไปทำงานหรือโรงเรียนให้เช้าขึ้น หาสิ่งที่มีความสุขทำ แล้ววันนี้ก็จะเป็นวันที่คุณมีความสุขตลอดวัน',
        'text_mid': 'กลางวัน: หลังจากที่คุณทานอาหารกลางวันเสร็จแล้วควรงีบหลีบสักครู่เพื่อให้สมองปลอดโปร่งแล้วคุณจะทำงานได้อย่างมีประสิทธิภาพ ',
        'text_nood': 'เย็น: หลังจากกลับบ้าน คุณน่าจะออกไปเดินเล่น หรือ นั่งเล่นที่สวนสาธารณะกับคนในครอบครัวหรือคนพิเศษ พูดคุยกับคนรอบตัวเพื่อแลกเปลี่ยนความคิด',
        'tip_head': null,
        'tip_body': null
      },
      '24': {
        'text': 'Day -24 เช้านี้คุณลองสำรวจตัวเองในกระจก เพื่อที่จะทำตัวเองให้พร้อมรับกับสัปดาห์สุดท้ายในการที่จะเลิกบุหรี่ได้อย่างสมบูรณ์',
        'text_day': 'เช้า  วันนี้คุณคุณลองออกกำลังกายตอนเช้าดูบ้างไหมค่ะ ลองไปปั่นจักรยาน  วิ่งที่สวนสาธารณะ หรือจะทำโยคะที่บ้านดูก็ได้ เพื่อเช้าที่สดใส พร้อมรับสิ่งใหม่ๆที่จะเข้ามาในวันนี้ค่ะ',
        'text_mid': 'กลางวัน ตอนกลางวันลองไปนั่งเล่นร้านขนมหวานอร่อยๆ เพื่อเป็นกำลังใจให้ตัวเอง ',
        'text_nood': 'ตอนเย็น เปลี่ยนทรงผม และ เสื้อผ้าใหม่ เพื่อปรับเปลี่ยนบุคลิกของตัวเอง  เพราะบุคลิกภาพที่ดีนำมาซึ่งภาพลักษณ์ที่ดีและความมั่นใจ',
        'tip_head': null,
        'tip_body': null
      },
      '25': {
        'text': 'Day -25 เหลืออีกแค่ 5   วันจะครบหนึ่งเดือนแห่งความสำเร็จแล้ว ตลอดสามสัปดาห์ที่ผ่านมา คุณได้ผ่านอุปสรรคและปัญหามากมาย แต่คุณเห็นแล้วใช่ไหมคะว่า ตัวคุณเองเปลี่ยนแปลงไปในด้านที่ดีขึ้น คนรอบข้างก็สังเกตเห็นถึงความเปลี่ยนแปลงของคุณเหมือนกันนะคะ คุณทำได้ดีแล้วค่ะ และเราอยากให้คุณทำมันต่อไป',
        'text_day': 'เช้า : วันนี้เริ่มด้วยการรดน้ำต้นไม้รอบบ้าน แล้วออกไปเดินเล่นกันนะคะ ',
        'text_mid': 'กลางวัน : หาหนังสือเกร็ดความรู้รอบตัวอ่านเพื่อใช้เวลาว่างให้เป็นประโยชน์ ',
        'text_nood': 'เย็น : หาหนังสนุก ๆ ดูสักเรื่องกับคนที่คุณรักนะคะ ',
        'tip_head': 'แนะนำ 3 เคล็ดลับยอดนิยมที่คนนำไปใช้แล้วสามารถเลิกสูบบุหรี่ได้จริง',
        'tip_body': '1. ทำความสะอาดบ้านรวมถึงอุปกรณ์ที่ใช้ในการสูบบุหรี่ และอย่าให้ใครที่สูบบุหรี่เข้ามาใกล้เด็ดขาด 2. หลีกเลี่ยงการดื่มเครื่องดื่มแอลกอฮอล์ เพราะเป็นเหตุผลที่ทำให้คนย้อนกลับไปสูบบุหรี่ใหม่ 3. ศึกษาวิธีจัดการกับความเครียดอย่างอื่นนอกจากการใช้บุหรี่ เพราะหลายคนเลือกสูบบุหรี่ก็เพราะความเครียดนั่นเอง'     
      },
      '26': {
        'text': 'Day -26  วันนี้รู้สึกยังไงบ้างคะ หลังจากคุณหยุดสูบบุหรี่เป็นเวลา 25 วันแล้ว สังเกตไหมคะว่าการทำกิจกรรมในแต่ละวันนั้นจะช่วยลดความสนใจในการอยากสูบบุหรี่ และยังได้ประโยชน์จากการทำกิจกรรมนั้นๆด้วยค่ะ  เพื่อไม่เป็นการเสียเวลาเรามาเริ่มทำกิจกรรมของวันนี้กันเลยค่ะ',
        'text_day': 'เช้า : หากิจกรรมเบา ๆ เช่น ว่ายน้ำยามเช้า หรือ ออกพาสัตว์เลี้ยงไปเดินเล่นนะคะ หากไม่มีสัตว์เลี้ยงลองชวนคนรู้ใจหรือเพื่อนสนิทไปเดินเล่นที่สวนสาธารณะกันนะคะ ',
        'text_mid': 'กลางวัน : หาร้านอาหารที่คุณชอบไปประจำกับเมนูคู่ใจ หากวันนี้ตรงกับวันหยุดของคุณ เราแนะนำให้คุณไปปิกนิก หรือเที่ยวตามสถานที่สำคัญในจังหวัดของคุณ หากคุณมีความสนใจในด้านดนตรีลองฝึกเล่นเครื่องดนตรีสักชิ้นไหมคะ เช่น กีตาร์ ตีกลอง ',
        'text_nood': 'เย็น : เย็นนี้ลองหากิจกรรมพักผ่อนหย่อนใจ เช่น ร้องคาราโอเกะกับเพื่อน โยนโบว์ลิง หรือหากคุณเหนื่อยล้าจากการทำงานหรือเรียน คุณสามารถนอนพักผ่อน เปิดเพลงฟังที่บ้านได้ค่ะ',
        'tip_head': '',
        'tip_body': 'แนะนำ ฟังเพลงคลาสสิก- จากการวิจัยพบว่าการฟังเพลงคลาสสิกสามารถลดความเครียดได้ดีกว่าเพลงประเภทอื่น เพราะเพลงคลาสสิกเป็นเพลงบรรเลง ไม่มีเนื้อร้อง ทำให้ฟังได้เรื่อยๆ ไม่ต้องคิดตาม และช่วยให้สมองผ่อนคลาย อีกทั้งช่วยเรื่องอาการนอนไม่หลับ '
      },
      '27': {
        'text': 'Day-27  สวัสดีกับเช้าที่สดใสอีกวันนะคะ  วันนี้เรามีคำคมเพื่อแรงบันดาลใจมาฝากนะคะ “ถ้าคุณเดินถูกทาง คุณจะอยากเดินต่อไปเรื่อยๆ และในที่สุด คุณก็จะก้าวหน้า – บารัค โอบามา”',
        'text_day': 'เช้า : ลองนึกถึงประโยชน์ของการเลิกบุหรี่สิคะ คุณนอนหลับสบายขึ้นใช่หรือไม่คะ เห็นไหมคะว่าผลของการเลิกบุหรี่ดีแค่ไหน และอย่าลืมหาอร่อยๆมีประโยชน์รับประทานในมื้อเช้านะคะ',
        'text_mid': 'กลางวัน : ผ่อนคลายความเครียด ความเหนื่อยล้าหน่อยนะคะ เช่น พักฟังเพลงเพราะๆ หรือพูดคุยกับเพื่อนร่วมงาน ',
        'text_nood': 'เย็น : วันนี้อย่าลืมออกกำลังกายนะคะ ควรออกอย่างสม่ำเสมอทุกวัน และ อย่าลืมควบคุมอาหารด้วย ย้ำเตือนตนเองเสมอว่าอย่ากลับไปสูบบุหรี่อีก คืนนี้นอนหลับฝันดีนะคะ',
        'tip_head': null,
        'tip_body': null
      },
      '28': {
        'text': 'Day- 28 ผ่านมาถึงวันที่28แล้วนะคะ มันดีมากเลยนะคะที่คุณสามารถปรับเปลี่ยนพฤติกรรมของคุณได้ แสดงให้เห็นว่าคุณได้ตระหนักว่าคุณรักและใส่ใจตัวเองและคนรอบข้างมากขึ้น ที่ผ่านมาคุณพยายามได้ดีมากนะคะ คอยย้ำเตือนตัวเองไว้นะคะความพยายามอยู่ที่ไหน ความสำเร็จอยู่ที่นั่น',
        'text_day': 'เช้า+กลางวัน : วันนี้ลองหากิจกรรมสบายๆทำดูนะคะ เช่น ดูหนัง หาเมนูอาหารใหม่ๆ หากเป็นวันว่างจากการทำงานอาจจะหาวางแผนเที่ยวต่างจังหวัดดูนะคะ',
        'text_mid': '',
        'text_nood': 'เย็น : เย็นนี้ชวนเพื่อนที่ทำงานหรือครอบครัวเปลี่ยนบรรยากาศออกไปทานข้าวข้างนอก หรือ ชวนมารับประทานอาหารที่คุณทำเองที่ห้อง',
        'tip_head': null,
        'tip_body': null
      },
      '29': {
        'text': 'Day-29 ตอนนี้เหลืออีก1วันแล้วนะที่คุณจะครบ 30 วันของการเลิกบุหรี่และคุณจะสามารถเลิกบุหรี่ได้อย่างสมบูรณ์ เห็นไหมว่าคุณดีขึ้นกว่าวันเก่าๆที่ผ่านมา หารางวัลให้ตัวเองซิคะ เพื่อต้อนรับวันที่ 30 จะมาถึง คุณใกล้ประสบความสำเร็จแล้วค่ะ คุณมีความมุ่งมั่นและตั้งใจเป็นอย่างมากนะคะ ',
        'text_day': 'เช้า : ถึงแม้ว่าจะใกล้ถึงวันสุดท้ายแล้ว อย่าลืมนะคะว่าคุณต้องออกกำลังกายอย่างสม่ำเสมอ อย่างเช่นเช้านี้ ออกกำลังสัก 30 นาทีก่อนทำกิจวัตรประจำวัน',
        'text_mid': 'กลางวัน : หลังจากนี้คุณต้องรับประทานอาหารมีประโยชน์ครบ 5 หมู่ ทุกๆวัน หากคุณรู้สึกเบื่อ อาจออกไปรับประทานอาหารข้างนอกบ้านหรือค้นหาร้านใหม่ๆ รับประทานตอนเวลาพักกลางวันของการทำงาน',
        'text_nood': 'เย็น : ทบทวนตั้งแต่วันแรกจนถึงวันนี้คุณได้บรรลุเป้าหมายในการเลิกสูบบุหรี่ได้แล้วหรือยัง ลองจดบันทึกกิจวัตรประจำวันของคุณที่ทำให้เลิกบุหรี่ได้ เพื่อนำมาย้ำเตือนแก่ตนเองว่าจะไม่กลับมาสูบบุหรี่อีก หลังจากนี้เราแนะนำให้คุณจัดตารางกิจวัตรประจำวันในแต่ละวันเพื่อเป็นแนวทางในการใช้ชีวิตต่อไป',
        'tip_head': 'แนะนำ หลังเลิกบุหรี่ควรดูแลตัวเองอย่างไร เพื่อไม่ให้กลับไปสูบอีก',
        'tip_body': '1.งดการดื่มเครื่องดื่มที่มีคาเฟอีน อาทิเช่น ชา กาแฟ เครื่องดื่มที่มีแอลกอฮอล์ เนื่องจากจะส่งเสริมให้ความอยากสูบบุหรี่กลับมาและเน้นการรับประทานอาหารที่มีวิตามินซีสูงแทน 2.หากิจกรรมทำยามว่าง เพื่อไม่ให้ใช้เวลาว่างไปกับการสูบบุหรี่อีก 3.หลายคนอาจจะมีอาการกระวนกระวาย นอนไม่หลับ ซึ่งต้องใช้ความอดทนแล้วอาการเหล่านั้นจะหายไป แต่หากเวลาผ่านไปแล้วไม่รู้สึกดีขึ้นให้ปรึกษาแพทย์เพื่อหาสาเหตุ'
      },
      '30': {
        'text': 'Day-30  ยินดีด้วยนะคะ!! เช้านี้เป็นเช้าวันสุดท้ายแล้ว คุณลองทำแบบประเมินการติดบุหรี่อีกสักครั้ง แล้วดูสิคะว่าผลลัพธ์ที่ได้มันดีขึ้นแค่ไหน คุณรู้สึกดีมากใช่ไหมค่ะ เราขอยินดีกับความสำเร็จของคุณด้วยค่ะ หลังจากนี้คุณต้องทำสัญญากับตนเองว่าคุณจะไม่กลับไปสูบบุหรี่อีก คุณเก่งมากที่คุณทำได้ อย่าลืมแนะนำให้กับเพื่อนๆนะคะ ให้เลิกยุ่งกับบุหรี่ได้แล้วค่ะ ',
        'text_day': '',
        'text_mid': '',
        'text_nood': '',
        'tip_head': '',
        'tip_body': 'แนะนำ การหาที่ปรึกษา นอกจากคุณจะขอคำปรึกษาและกำลังใจจากคนรอบข้างแล้ว คุณยังขอคำปรึกษากับคนรู้จักที่สามารถเลิกสูบบุหรี่ได้สำเร็จมาแล้ว คลินิกเลิกบุหรี่ สถานที่เลิกบุหรี่ หรือศูนย์บริการเลิกบุหรี่ทางโทรศัพท์แห่งชาติ (Thailand National Quitline) สายด่วน โทร.1600'
      },
  }

    this.text = this.data[this.thisDay]['text'];
    this.text_day = this.data[this.thisDay]['text_day'];
    this.text_mid = this.data[this.thisDay]['text_mid'];
    this.text_noon = this.data[this.thisDay]['text_noon'];


  }

  ionViewWillLeave() {



  }


}
